In [1]:
import pandas as pd

In [2]:
pd.DataFrame({'Yes': [50, 21], 'No': [131,2]})

   Yes   No
0   50  131
1   21    2

In [3]:
pd.DataFrame({'Bob': ['I liked it.', 'It was awful.'], 'Sue': ['Pretty good.', 'Bland.']})

             Bob           Sue
0    I liked it.  Pretty good.
1  It was awful.        Bland.

In [4]:
pd.DataFrame({'Bob': ['I liked it.', 'It was awful.'], 
              'Sue': ['Pretty good.', 'Bland.']},
             index=['Product A', 'Product B'])

                     Bob           Sue
Product A    I liked it.  Pretty good.
Product B  It was awful.        Bland.

In [5]:
pd.Series([1, 2, 3, 4, 5])

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [6]:
pd.Series([30, 35, 40], index=['2015 Sales', '2016 Sales', '2017 Sales'], name='Product A')

2015 Sales    30
2016 Sales    35
2017 Sales    40
Name: Product A, dtype: int64

In [9]:
fifa = pd.read_csv('./datasets/kaggle/data-for-datavis/fifa.csv')

In [10]:
fifa

           Date   ARG  BRA   ESP   FRA  GER   ITA
0    1993-08-08   5.0  8.0  13.0  12.0  1.0   2.0
1    1993-09-23  12.0  1.0  14.0   7.0  5.0   2.0
2    1993-10-22   9.0  1.0   7.0  14.0  4.0   3.0
3    1993-11-19   9.0  4.0   7.0  15.0  3.0   1.0
4    1993-12-23   8.0  3.0   5.0  15.0  1.0   2.0
..          ...   ...  ...   ...   ...  ...   ...
281  2018-02-15   4.0  2.0   6.0   9.0  1.0  14.0
282  2018-03-15   4.0  2.0   6.0   9.0  1.0  14.0
283  2018-04-12   5.0  2.0   8.0   7.0  1.0  20.0
284  2018-05-17   5.0  2.0   8.0   7.0  1.0  20.0
285  2018-06-07   5.0  2.0  10.0   7.0  1.0  19.0

[286 rows x 7 columns]

In [11]:
fifa.ARG

0       5.0
1      12.0
2       9.0
3       9.0
4       8.0
       ...
281     4.0
282     4.0
283     5.0
284     5.0
285     5.0
Name: ARG, Length: 286, dtype: float64

In [12]:
fifa['ARG']

0       5.0
1      12.0
2       9.0
3       9.0
4       8.0
       ...
281     4.0
282     4.0
283     5.0
284     5.0
285     5.0
Name: ARG, Length: 286, dtype: float64

In [13]:
fifa.iloc[0]

Date    1993-08-08
ARG              5
BRA              8
ESP             13
FRA             12
GER              1
ITA              2
Name: 0, dtype: object

In [15]:
fifa.iloc[:, 0]

0      1993-08-08
1      1993-09-23
2      1993-10-22
3      1993-11-19
4      1993-12-23
          ...
281    2018-02-15
282    2018-03-15
283    2018-04-12
284    2018-05-17
285    2018-06-07
Name: Date, Length: 286, dtype: object

In [16]:
fifa.iloc[:3, 0]

0    1993-08-08
1    1993-09-23
2    1993-10-22
Name: Date, dtype: object

In [17]:
fifa.iloc[[0,1,2,3], 0]

0    1993-08-08
1    1993-09-23
2    1993-10-22
3    1993-11-19
Name: Date, dtype: object

In [18]:
fifa.loc[0, 'ARG']

5.0

In [20]:
fifa.loc[:, ['ARG', 'GER']]

      ARG  GER
0     5.0  1.0
1    12.0  5.0
2     9.0  4.0
3     9.0  3.0
4     8.0  1.0
..    ...  ...
281   4.0  1.0
282   4.0  1.0
283   5.0  1.0
284   5.0  1.0
285   5.0  1.0

[286 rows x 2 columns]

In [21]:
fifa

           Date   ARG  BRA   ESP   FRA  GER   ITA
0    1993-08-08   5.0  8.0  13.0  12.0  1.0   2.0
1    1993-09-23  12.0  1.0  14.0   7.0  5.0   2.0
2    1993-10-22   9.0  1.0   7.0  14.0  4.0   3.0
3    1993-11-19   9.0  4.0   7.0  15.0  3.0   1.0
4    1993-12-23   8.0  3.0   5.0  15.0  1.0   2.0
..          ...   ...  ...   ...   ...  ...   ...
281  2018-02-15   4.0  2.0   6.0   9.0  1.0  14.0
282  2018-03-15   4.0  2.0   6.0   9.0  1.0  14.0
283  2018-04-12   5.0  2.0   8.0   7.0  1.0  20.0
284  2018-05-17   5.0  2.0   8.0   7.0  1.0  20.0
285  2018-06-07   5.0  2.0  10.0   7.0  1.0  19.0

[286 rows x 7 columns]

In [26]:
fifa.set_index('Date')

             ARG  BRA   ESP   FRA  GER   ITA
Date
1993-08-08   5.0  8.0  13.0  12.0  1.0   2.0
1993-09-23  12.0  1.0  14.0   7.0  5.0   2.0
1993-10-22   9.0  1.0   7.0  14.0  4.0   3.0
1993-11-19   9.0  4.0   7.0  15.0  3.0   1.0
1993-12-23   8.0  3.0   5.0  15.0  1.0   2.0
...          ...  ...   ...   ...  ...   ...
2018-02-15   4.0  2.0   6.0   9.0  1.0  14.0
2018-03-15   4.0  2.0   6.0   9.0  1.0  14.0
2018-04-12   5.0  2.0   8.0   7.0  1.0  20.0
2018-05-17   5.0  2.0   8.0   7.0  1.0  20.0
2018-06-07   5.0  2.0  10.0   7.0  1.0  19.0

[286 rows x 6 columns]

In [28]:
fifa.describe()

              ARG         BRA         ESP         FRA         GER         ITA
count  286.000000  286.000000  286.000000  286.000000  286.000000  286.000000
mean     5.454545    3.171329    5.321678    8.958042    5.104895    8.353147
std      4.012659    3.620897    3.908787    6.822948    4.354813    4.514822
min      1.000000    1.000000    1.000000    1.000000    1.000000    1.000000
25%      3.000000    1.000000    2.000000    3.000000    2.000000    4.000000
50%      5.000000    1.500000    5.000000    7.000000    4.000000    8.000000
75%      7.000000    4.000000    8.000000   15.000000    5.000000   12.000000
max     24.000000   22.000000   25.000000   27.000000   22.000000   20.000000

In [29]:
fifa.ARG.unique()

array([ 5., 12.,  9.,  8., 10.,  6.,  7., 15., 24., 22., 17., 19., 18.,
       21., 16., 13.,  3.,  2.,  4., 11.,  1.])

In [30]:
fifa.ARG.value_counts()

3.0     53
5.0     38
2.0     32
6.0     26
1.0     26
4.0     26
7.0     23
8.0     18
9.0     13
10.0    12
13.0     3
19.0     3
17.0     3
11.0     2
22.0     2
16.0     1
21.0     1
18.0     1
24.0     1
15.0     1
12.0     1
Name: ARG, dtype: int64

In [31]:
fifa.groupby('Date').ARG.count()

Date
1993-08-08    1
1993-09-23    1
1993-10-22    1
1993-11-19    1
1993-12-23    1
             ..
2018-02-15    1
2018-03-15    1
2018-04-12    1
2018-05-17    1
2018-06-07    1
Name: ARG, Length: 286, dtype: int64

In [33]:
fifa.ARG.dtype

dtype('float64')

In [34]:
fifa.dtypes

Date     object
ARG     float64
BRA     float64
ESP     float64
FRA     float64
GER     float64
ITA     float64
dtype: object

In [35]:
fifa.ARG.astype('float64')

0       5.0
1      12.0
2       9.0
3       9.0
4       8.0
       ...
281     4.0
282     4.0
283     5.0
284     5.0
285     5.0
Name: ARG, Length: 286, dtype: float64

In [36]:
fifa[pd.isnull(fifa.ARG)]

Empty DataFrame
Columns: [Date, ARG, BRA, ESP, FRA, GER, ITA]
Index: []

In [37]:
# Fill NaN
fifa.ARG.fillna(-1.0)

0       5.0
1      12.0
2       9.0
3       9.0
4       8.0
       ...
281     4.0
282     4.0
283     5.0
284     5.0
285     5.0
Name: ARG, Length: 286, dtype: float64

In [38]:
fifa.ARG.replace(5.0, 100.0)

0      100.0
1       12.0
2        9.0
3        9.0
4        8.0
       ...
281      4.0
282      4.0
283    100.0
284    100.0
285    100.0
Name: ARG, Length: 286, dtype: float64

In [39]:
fifa.rename(columns={'ARG': 'ARg'})

           Date   ARg  BRA   ESP   FRA  GER   ITA
0    1993-08-08   5.0  8.0  13.0  12.0  1.0   2.0
1    1993-09-23  12.0  1.0  14.0   7.0  5.0   2.0
2    1993-10-22   9.0  1.0   7.0  14.0  4.0   3.0
3    1993-11-19   9.0  4.0   7.0  15.0  3.0   1.0
4    1993-12-23   8.0  3.0   5.0  15.0  1.0   2.0
..          ...   ...  ...   ...   ...  ...   ...
281  2018-02-15   4.0  2.0   6.0   9.0  1.0  14.0
282  2018-03-15   4.0  2.0   6.0   9.0  1.0  14.0
283  2018-04-12   5.0  2.0   8.0   7.0  1.0  20.0
284  2018-05-17   5.0  2.0   8.0   7.0  1.0  20.0
285  2018-06-07   5.0  2.0  10.0   7.0  1.0  19.0

[286 rows x 7 columns]